[
  {
    "id": 1,
    "Longitude": "1.1924597737473719",
    "Latitude": "104.08920451777048",
    "Nama": "Nuvasa Bay",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "09.00-17.00",
    "Desc.": "Nuvasa Bay is a beautiful and vibrant integrated resort destination located on the island of Batam, in the Riau Islands Province of Indonesia. Nestled along the sparkling coastline of the South China Sea, Nuvasa Bay offers a perfect blend of modern facilities, natural beauty, and exciting activities, making it an ideal getaway for travelers seeking a mix of relaxation and adventure.",
    "Activity": "1. Water Sports and Beach Activities: Enjoy the crystal-clear waters of the South China Sea by indulging in a variety of water sports. Try jet skiing, banana boat rides, snorkeling, or even explore the underwater world through scuba diving. For those seeking a more leisurely time, relax on the sandy beaches, soak up the sun, and take refreshing dips in the sea.\n2. Golfing at Tering Bay Golf & Country Club: Golf enthusiasts can experience world-class golfing at the Tering Bay Golf & Country Club. The golf course offers stunning views of the surrounding landscapes and sea, making it a delightful experience for both seasoned golfers and beginners.\n3. Mangrove Forest Exploration: Embark on a nature-filled journey through the lush mangrove forests surrounding Nuvasa Bay. Join a guided tour to witness the rich biodiversity of the mangroves, spot various bird species, and discover the unique ecosystem.\n4. Nuvasa Beach Club: Unwind and pamper yourself at the Nuvasa Beach Club. Relax by the infinity pool, sip on refreshing cocktails, and savor delicious cuisine while enjoying the panoramic sea views.\n5. Island Hopping: Take a boat tour and explore the nearby picturesque islands around Nuvasa Bay. Visit Pulau Abang, Pulau Putri, or other nearby islands to enjoy unspoiled beaches and turquoise waters.\n6. Cultural Experiences: Immerse yourself in the local culture by visiting nearby villages and experiencing traditional Indonesian dance performances or attending local events and festivals.\n7. Sunset Cruises: Witness the breathtaking sunset over the South China Sea with a sunset cruise. Relax on a boat as you soak in the mesmerizing colors of the sky while the sun sets below the horizon.",
    "Picture": "",
    "": "https://www.andalastourism.com/nuvasa-bay-batam"
  },
  {
    "id": 2,
    "Longitude": "1.156321233032294",
    "Latitude": "104.08426367123171",
    "Nama": "Kampung Terih",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Kampung Tua Terih Jl. Ketapang, Sambau, Nongsa, Batam City, Riau Islands 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "08.00-18.00",
    "Desc.": "Kampung Terih is a charming village located in Batam, Indonesia. It is a place that reflects the rich cultural heritage and traditional lifestyle of the local Indonesian community. Despite being situated close to modern developments in Batam, Kampung Terih retains its old-world charm, making it a unique and authentic destination for travelers looking to experience the local culture.",
    "Activity": "1. Cultural Immersion: Take a stroll through the narrow lanes of Kampung Terih and immerse yourself in the traditional Indonesian way of life. Interact with the friendly locals, learn about their customs, and witness their traditional arts and crafts.\n2. Traditional Dance and Music Performances: Experience the vibrancy of Indonesian culture by attending traditional dance and music performances in the village. These performances often showcase the rich folklore and legends of the region.\n3. Visit the Local Markets: Explore the local markets in Kampung Terih to discover an array of traditional Indonesian products, including handicrafts, textiles, and local delicacies. This is a great opportunity to shop for unique souvenirs to take home.\n4. Traditional Fishing: Experience the traditional way of fishing with local fishermen. You can join them in their fishing boats, learn their techniques, and even catch some fresh fish.\n5. Photography Opportunities: Kampung Terih offers numerous picturesque spots that are perfect for photography enthusiasts. Capture the village's rustic charm and the warm smiles of the locals.\n6. Culinary Delights: Indulge in authentic Indonesian cuisine at local eateries in Kampung Terih. Try regional dishes such as Nasi Padang, Rendang, Soto, and other local specialties.\n7. Batik Workshops: Engage in a Batik workshop where you can learn the art of Batik making from skilled artisans. Create your own Batik masterpiece to cherish as a memorable keepsake.\n8. Explore Nature: Surrounding Kampung Terih, you'll find lush green landscapes and serene rice paddies. Take a leisurely walk or bike ride through the countryside to enjoy the natural beauty of the area.",
    "Picture": "",
    "": ""
  },
  {
    "id": 3,
    "Longitude": "1.118394",
    "Latitude": "103.952007",
    "Nama": "Tebing Langit",
    "Downloaded Photo": 3,
    "Class": "Natural Attraction",
    "Address": "Jl. Ir. Sutami, Tj. Pinggir, Kec. Sekupang, Kota Batam, Kepulauan Riau 29424",
    "Disctrict": "Sekupang",
    "Operational Hour": "07.00-18.00",
    "Desc.": "Tebing Langit, also known as \"Heaven's Cliff,\" is a picturesque cliff area located in Sekupang, Batam, Riau Islands Province, Indonesia. The site offers breathtaking views of the South China Sea and the lush greenery that characterizes the region. It has become a favorite spot for both locals and tourists seeking a serene and scenic getaway.",
    "Activity": "1. Sightseeing and Photography: Tebing Langit offers stunning vistas, making it an ideal spot for sightseeing and photography. Visitors can capture mesmerizing panoramic views of the sea, surrounding islands, and the lush landscapes below.\n2. Sunrise and Sunset Views: One of the best times to visit Tebing Langit is during sunrise or sunset. Watching the sun rise or set from the cliff's edge creates a magical and unforgettable experience.\n3. Nature Walks and Hiking: There are usually well-maintained pathways and trails around Tebing Langit, providing opportunities for nature walks and light hiking. These walks offer a chance to immerse oneself in the natural beauty of the area.\n4. Picnicking: Tebing Langit is an excellent location for picnics with family and friends. Visitors can bring along their own food and enjoy a relaxing picnic while admiring the scenic views.\n5. Relaxation and Meditation: The tranquil atmosphere of Tebing Langit makes it a great place for relaxation and meditation. Many visitors come here to unwind and enjoy some peaceful moments.",
    "Picture": "",
    "": ""
  },
  {
    "id": 4,
    "Longitude": "1.123827",
    "Latitude": "103.935072",
    "Nama": "Taman Rusa",
    "Downloaded Photo": 3,
    "Class": "Park",
    "Address": "Tj. Pinggir, Kec. Sekupang, Kota Batam, Kepulauan Riau 29425",
    "Disctrict": "Sekupang",
    "Operational Hour": "07.00-18.00",
    "Desc.": "Taman Rusa Sekupang is a picturesque tourist destination built on approximately 12.2 hectares of land. This serene park offers a one-kilometer jogging track and a multipurpose building equipped for activities such as badminton and a gymnasium. The highlight of the park is its mini zoo, a child-friendly area where visitors can observe and directly feed the deer. Deer feed is available for purchase at a price ranging from Rp 5,000 to Rp 10,000 per package. In addition to deer, visitors can also admire rabbits, pigeons, and swans. Families with children need not worry about boredom, as the park features several play areas, including slides, swings, and other exciting recreational facilities. For educational purposes, the park also provides an educational section where visitors, including students and the general public, can learn about hydroponic plant cultivation, composting techniques, water recycling, solar-powered electricity, and rare plant species. Taman Rusa Sekupang promises a delightful and enriching experience for visitors of all ages, making it an ideal destination for leisure, education, and close encounters with wildlife.",
    "Activity": "1. Deer Viewing: The main attraction at Taman Rusa is the opportunity to observe and interact with deer. Visitors can see different species of deer in their natural habitat within the park.\n2. Feeding Deer: Many visitors enjoy feeding the deer with food provided at the park. It's a delightful experience to get up close to these gentle creatures and feed them.\n3. Nature Walks: Taman Rusa is typically set amidst lush greenery and gardens, providing a pleasant atmosphere for leisurely walks. Stroll around the park to enjoy the natural beauty and tranquility.\n5. Family Outings: Taman Rusa is a family-friendly destination, making it an ideal place for a day outing with loved ones. Kids, in particular, often enjoy the opportunity to interact with and learn about the deer.\n6. Picnicking: The park offers designated areas for picnics. Visitors can bring their own food and snacks to enjoy a picnic amidst the serene surroundings.\nPhotography: Taman Rusa provides ample opportunities for photography. Capture memorable moments of deer interactions and the scenic landscapes.",
    "Picture": "",
    "": ""
  },
  {
    "id": 5,
    "Longitude": "1.1273917960632145",
    "Latitude": "103.92923507769095",
    "Nama": "Taman Kolam",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Jl. RE Martadinata, Tj. Pinggir, Kec. Sekupang, Kota Batam, Kepulauan Riau 29425",
    "Disctrict": "Sekupang",
    "Operational Hour": "07.00-18.00",
    "Desc.": "Taman Kolam Sekupang is a charming park nestled in the city of Batam, Indonesia, offering a delightful retreat for families. The park's main attraction is its large fish pond adorned with beautiful lotus plants, providing a picturesque backdrop for photography and relaxation. Families can spend quality time together, capturing cherished moments amidst the serene ambiance. Moreover, the park caters to fitness enthusiasts, featuring a jogging track for those seeking to exercise or cycle around the enchanting fish pond. Taman Kolam Sekupang is the perfect destination for a peaceful and enjoyable outing, combining the joys of nature, fitness, and family bonding.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 6,
    "Longitude": "1.11883",
    "Latitude": "103.954134",
    "Nama": "Batam Forest Top",
    "Downloaded Photo": 2,
    "Class": "Natural Attraction",
    "Address": "Bukit Harimau, Kec. Sekupang, Kota Batam, Kepulauan Riau 29424",
    "Disctrict": "Sekupang",
    "Operational Hour": "08.00-18.00",
    "Desc.": "Batam Forest Top is a captivating eco-tourism destination that offers a blend of fun, adventure, and learning. Explore trendy selfie spots amidst the lush forest, conquer thrilling Tree Top Games, and enjoy camping adventures. Discover traditional farming at Kampung Tani, encounter native wildlife at Kampung Satwa, and learn about recycling at Kampung Daur Ulang. It's a perfect destination for families, friends, and nature enthusiasts of all ages!",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 7,
    "Longitude": "1.145068",
    "Latitude": "103.948013",
    "Nama": "Tangga Seribu",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Tj. Pinggir, Kec. Sekupang, Kota Batam, Kepulauan Riau 29425",
    "Disctrict": "Sekupang",
    "Operational Hour": "09.00-20.00",
    "Desc.": "Tangga Seribu is a series of stairs that lead to the top of a hill in Batam. It is called \"Thousand Steps\" because the trail consists of approximately a thousand steps, making the hike physically demanding yet gratifying for those who complete it.",
    "Activity": "1. Hiking and Trekking: The primary activity at Tangga Seribu is hiking and trekking the challenging trail. As you ascend the stairs, you will pass through lush greenery and enjoy the natural beauty of the surrounding landscapes.\n2. Panoramic Views: The reward for completing the climb is the breathtaking panoramic views of Batam's coastline, the South China Sea, and the neighboring islands. The vantage point at the top of Tangga Seribu offers stunning photo opportunities.\n3. Fitness and Adventure: The hike up Tangga Seribu is a great way to stay active and enjoy an adventure in the outdoors. It attracts both fitness enthusiasts and nature lovers alike.\n4. Sunrise or Sunset Watching: Many hikers opt to begin their climb early in the morning to witness the sunrise from the hilltop. Alternatively, others choose to hike in the late afternoon to catch the sunset views.\n5. Photography: Tangga Seribu provides fantastic photo opportunities, making it a favorite spot for photography enthusiasts. Capture the scenic beauty of Batam from various angles along the trail.",
    "Picture": "",
    "": ""
  },
  {
    "id": 8,
    "Longitude": "1.122202",
    "Latitude": "104.054331",
    "Nama": "Welcome To Batam",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Tlk. Tering, Kec. Batam Kota, Kota Batam, Kepulauan Riau 29444",
    "Disctrict": "Batam Kota",
    "Operational Hour": "",
    "Desc.": "Welcome to \"Welcome to Batam Monument,\" a famous landmark nestled on Bukit Clara in Batam Center. This iconic spot draws tourists eager to capture picturesque photos against the backdrop of its lush surroundings. After embracing the scenic beauty, visitors can delight in a culinary adventure with a variety of eateries nearby, offering a taste of Batam's delectable cuisine. Experience the allure of Batam and its flavors at this captivating destination.\n\n\"Welcome to Batam Monument\" stands tall as a must-visit spot in the city, attracting travelers from all walks of life. The monument's panoramic views and serene ambiance make it an ideal place for cherished memories. Once you've captured the beauty of the surroundings, explore the diverse culinary scene, indulging in the delightful tastes of Batam's culinary offerings. Whether you're an avid photographer, a nature enthusiast, or a food lover, this landmark promises a delightful and fulfilling experience for all who visit.",
    "Activity": "Berfoto dan menikmati jajanan di sekitar tugu WTB",
    "Picture": "",
    "": ""
  },
  {
    "id": 9,
    "Longitude": "1.150647",
    "Latitude": "104.050455",
    "Nama": "Coastarina",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Sadai, Kec. Bengkong, Kota Batam, Kepulauan Riau 29444",
    "Disctrict": "Batam Kota",
    "Operational Hour": "08.00-22.00",
    "Desc.": "Coastarina is a beach resort located in Batam, Riau Islands Province, Indonesia. It offers visitors a mix of relaxation, water-based activities, and entertainment options, making it a favored destination for both locals and tourists.",
    "Activity": "1. Beach Activities: Enjoy the sandy beach at Coastarina and indulge in beach activities like sunbathing, beach volleyball, building sandcastles, and swimming in the sea.\n2. Water Sports: Coastarina provides various water sports and activities such as jet skiing, banana boat rides, parasailing, snorkeling, and kayaking. It's an excellent place for adventure seekers and water sports enthusiasts.\n3. Coastarina Water Park: The resort features a water park with slides, water playgrounds, and pools, providing fun-filled experiences for families and kids.\n4. Dining and Entertainment: Coastarina offers dining options with restaurants and cafes serving both local Indonesian cuisine and international dishes. There may also be live entertainment and music performances.\n5. Sunset Views: Witness breathtaking sunset views from the beach at Coastarina. The golden hues of the setting sun over the sea create a serene and memorable experience.\n6. Cycling and Jogging: Stay active during your trip by cycling or jogging along the scenic paths. Enjoy the refreshing sea breeze and lush green surroundings as you exercise.",
    "Picture": "",
    "": ""
  },
  {
    "id": 10,
    "Longitude": "1.1629277932466477",
    "Latitude": "104.04598854579676",
    "Nama": "Dino's Gate",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Bengkong Laut, Golden City, Kota Batam, Kepulauan Riau 29458",
    "Disctrict": "Batam Kota",
    "Operational Hour": "09.00-18.00",
    "Desc.": "Dino Gate Batam has become a favorite educational family attraction since its opening in 2019, renowned not only in Bengkong but also across other cities in Kepri. Nestled by the sea in the Golden City area, Bengkong Laut, the park offers encounters with various lifelike dinosaur species, providing an immersive and educational experience for all age groups. Additionally, Dino Gate Batam features a mini zoo with a diverse range of animals, offering delightful interactions and feeding opportunities. With exciting attractions like the Rabbit Farm House, swing rides, dinosaur rides, and trendy photo spots, such as bird nests, moons, doors to anywhere, 3D art, and photo booths, this family-friendly destination promises an enchanting and all-encompassing outing.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 11,
    "Longitude": "1.162062",
    "Latitude": "104.041073",
    "Nama": "Miniatur House Indonesia",
    "Downloaded Photo": 3,
    "Class": "Artificial Attraction",
    "Address": "Tj. Buntung, Kec. Bengkong, Kota Batam, Kepulauan Riau 29444",
    "Disctrict": "Batam Kota",
    "Operational Hour": "08.00-18.00",
    "Desc.": "Miniature House Indonesia\" is a park that contains replicas of traditional houses from various regions in Indonesia. These miniature traditional houses are built exactly like their real counterparts but in a miniaturized size, standing at approximately 1.5 meters tall. They are situated on a large expanse of grass, with each house surrounded by plant fences, creating the illusion that each house has its own garden and yard. The setting is picturesque and refreshing to the eyes.\n\nIn front of each traditional house, there is information about its name and the province it originates from. This feature is very interesting as it allows children to learn about the different traditional houses in Indonesia. Additionally, visitors can also see miniature places of worship. It can be a place for children to play and learn simultaneously.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 12,
    "Longitude": "1.17331",
    "Latitude": "104.070875",
    "Nama": "MAngrove Pandang Tak Jemu",
    "Downloaded Photo": 3,
    "Class": "Natural Attraction",
    "Address": "Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "07.00-18.00",
    "Desc.": "Mangrove Pandang Tak Jemu is a popular eco-tourism destination located in Batam, Riau Islands Province, Indonesia. The mangrove forest is known for its vast stretches of mangrove trees, diverse flora, and fauna, and it serves as an essential habitat for various species.\nMangrove Pandang Tak Jemu offers a peaceful and educational experience for nature enthusiasts, providing an opportunity to connect with the beauty of the mangrove ecosystem in Batam, Indonesia.",
    "Activity": "1. Mangrove Exploration: Visitors can explore the mangrove forest by taking a guided boat tour or boardwalks. The guided tours offer insights into the unique mangrove ecosystem and the importance of mangroves in maintaining ecological balance.\n2. Birdwatching: Mangrove forests are home to a wide variety of bird species. Birdwatchers can spot various migratory and resident birds, making it a rewarding experience for bird enthusiasts.\n3. Mangrove Planting: Some tours may offer visitors the opportunity to participate in mangrove planting activities, contributing to conservation efforts and the expansion of mangrove habitats.\n4. Sunset Cruises: Enjoy a peaceful sunset cruise through the mangrove forest, taking in the scenic beauty as the sun sets over the water.\n5. Photography: Mangrove Pandang Tak Jemu provides excellent opportunities for nature photography. Capture the serene beauty of the mangroves, wildlife, and picturesque landscapes.\n6. Conservation and Education: The mangrove forest serves as an educational site where visitors can learn about the importance of mangrove conservation and its role in protecting coastal areas and marine life.",
    "Picture": "",
    "": ""
  },
  {
    "id": 13,
    "Longitude": "1.170018",
    "Latitude": "104.081643",
    "Nama": "Kebun Raya Batam",
    "Downloaded Photo": 3,
    "Class": "Park",
    "Address": "Jl. Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "08.00-18.00",
    "Desc.": "Kebun Raya Batam, also known as the Batam Botanical Garden, is a green oasis and conservation area situated on the island of Batam, Riau Islands Province, Indonesia. The botanical garden serves as a place for preserving and showcasing a diverse collection of plant species native to the region and from around the world.\nKebun Raya Batam offers a refreshing escape for nature enthusiasts and provides a valuable opportunity to learn about the rich plant diversity of Batam and the surrounding region. It is an excellent destination for those seeking a peaceful and educational experience amidst lush greenery in Batam, Indonesia.",
    "Activity": "1. Botanical Garden Tour: Visitors can take a leisurely stroll or guided tour through the botanical garden to explore the diverse plant collections, including tropical flowers, trees, and rare species.\n2. Nature Walks: The garden offers pathways and trails, making it an excellent place for nature walks and birdwatching. It provides opportunities to spot various bird species and other wildlife.\n3. Educational Programs: Kebun Raya Batam may offer educational programs, workshops, and exhibitions to raise awareness about environmental conservation and plant biodiversity.\n4. Photography: The botanical garden's picturesque setting provides great photo opportunities, making it a favorite spot for photography enthusiasts.\n5. Relaxation: The serene and tranquil atmosphere of the garden offers a perfect setting for relaxation and spending quality time amidst nature.",
    "Picture": "",
    "": ""
  },
  {
    "id": 14,
    "Longitude": "5.195169",
    "Latitude": "97.075943",
    "Nama": "Agro Wisata Buah NAga",
    "Downloaded Photo": 1,
    "Class": "Natural Attraction",
    "Address": "Pulau Rempang, Kecamatan galang, Rempang Cate, Galang, Kota Batam, Kepulauan Riau 29434",
    "Disctrict": "Galang",
    "Operational Hour": "09.00-21.00",
    "Desc.": "Agro Wisata Buah Naga offers a unique and informative experience for visitors interested in dragon fruit cultivation and agrotourism. It's an excellent opportunity to learn about dragon fruit farming and enjoy the natural beauty of Batam, Indonesia.",
    "Activity": "1. Dragon Fruit Plantation Tours: Visitors can take guided tours of the dragon fruit plantation, where they can learn about the cultivation, harvesting, and processing of dragon fruit.\n2. Fruit Tasting: Taste the delicious and nutritious dragon fruit, known for its vibrant pink or red flesh and sweet flavor. Dragon fruit is not only tasty but also rich in antioxidants and nutrients.\n3. Educational Farming Activities: The attraction may offer hands-on activities such as planting dragon fruit or participating in farm chores, providing an interactive and educational experience.\n4. Dragon Fruit Products: Visitors can purchase various dragon fruit-based products, such as juices, jams, and snacks, as souvenirs to take home.\n5. Photography: The vibrant colors of the dragon fruit plants and the picturesque landscapes make it a great location for photography.",
    "Picture": "",
    "": ""
  },
  {
    "id": 15,
    "Longitude": "1.0875467227428972",
    "Latitude": "103.94280425832288",
    "Nama": "Agro Wisata Jambu MArina",
    "Downloaded Photo": 2,
    "Class": "Natural Attraction",
    "Address": "Jl. Raya Marina City, Tj. Riau, Kec. Sekupang, Kota Batam, Kepulauan Riau 29425",
    "Disctrict": "Sekupang",
    "Operational Hour": "08.00-19.00",
    "Desc.": "Agro Wisata Jambu Marina offers an educational and enjoyable experience for visitors interested in guava cultivation and agrotourism. It's a great opportunity to learn about guava farming and appreciate the natural beauty of Batam, Indonesia.",
    "Activity": "1. Guava Plantation Tours: Visitors can take guided tours of the guava plantation, where they can learn about the cultivation techniques, care for guava trees, and the process of harvesting guava fruits.\n2. Guava Tasting: Taste fresh and juicy guava fruits, known for their sweet and refreshing flavor. Guava is not only delicious but also rich in essential vitamins and minerals.\n3. Educational Farming Activities: The attraction may offer interactive activities such as picking guava fruits, participating in farm activities, and gaining insights into guava farming practices.\n4. Guava Products: Visitors can have the opportunity to purchase various guava-based products, such as guava jams, juices, and other guava-related items.\n5. Picnicking: Agro Wisata Jambu Marina may provide picnic spots or designated areas for visitors to relax and enjoy the tranquil surroundings.\n6. Photography: The greenery of the guava plantation and the natural setting make it a lovely place for photography.",
    "Picture": "",
    "": ""
  },
  {
    "id": 16,
    "Longitude": "1.085002",
    "Latitude": "103.97251",
    "Nama": "Hutan Wisata Mata Kucing",
    "Downloaded Photo": 3,
    "Class": "Natural Attraction",
    "Address": "Jl. Taman Bukit Golf, Tj. Riau,, Kibing, Sekupang, Batam City, Riau Islands 29424",
    "Disctrict": "Sekupang",
    "Operational Hour": "08.30-18.00",
    "Desc.": "Hutan Wisata Mata Kucing Batam is a captivating nature destination in Batam where you can immerse yourself in the wonders of the great outdoors while encountering various fauna, including eagles, monkeys, black gibbons, brown gibbons, and many more. Often referred to as a mini zoo, this place offers a unique experience as it stands out from traditional zoos due to its natural and authentic ambiance.\n\nBeyond the wildlife encounters, visitors can indulge in a range of exciting activities, such as flying fox rides, hiking or hill trekking, and swimming amidst the lush surroundings, creating a sensation of swimming amidst a forest. The serene environment and breathtaking foliage make it a truly immersive and refreshing experience, allowing you to connect with nature in an extraordinary way. Whether you seek wildlife encounters, thrilling adventures, or tranquil moments in nature's embrace, Hutan Wisata Mata Kucing Batam promises an unforgettable and rejuvenating outing for all.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 17,
    "Longitude": "1.0842931200610917",
    "Latitude": "103.94953845606284",
    "Nama": "Kampung Sawah by Jambu Madu Edufarm",
    "Downloaded Photo": 2,
    "Class": "Natural Attraction",
    "Address": "Tj. Riau, Kec. Sekupang, Kota Batam, Kepulauan Riau 29425",
    "Disctrict": "Sekupang",
    "Operational Hour": "09.00-17.00",
    "Desc.": "Kampung Sawah by Jambu Madu Edufarm offers an educational and culturally enriching experience for visitors interested in guava cultivation, eco-friendly practices, and the traditional village lifestyle of Batam, Indonesia. It's an excellent opportunity to learn about agriculture and rural traditions while enjoying the natural beauty of the countryside.",
    "Activity": "1. Guava Plantation Tours: Visitors can take guided tours of the guava plantation, where they can learn about the cultivation of guava, the harvesting process, and how guava products are made.\n2. Educational Farming Activities: The attraction may provide hands-on experiences such as picking guava fruits, planting crops, and participating in farm activities to understand the farming process better.\n3. Traditional Village Life: Visitors can immerse themselves in the traditional village setting, experiencing the lifestyle, customs, and culture of rural Indonesia.\n4. Eco-Friendly Practices: Kampung Sawah by Jambu Madu Edufarm may promote eco-friendly practices, such as organic farming and sustainable agriculture, which can be educational for visitors.\n5. Guava Products: The farm may offer various guava-based products, such as guava jams, juices, and other items, for purchase as souvenirs.\n6. Picnicking: The village provides picnic spots or resting areas for visitors to relax and enjoy the peaceful surroundings.",
    "Picture": "",
    "": ""
  },
  {
    "id": 18,
    "Longitude": "0.939987336901875",
    "Latitude": "104.06481815287042",
    "Nama": "Agro Mulyo Eco Adventures",
    "Downloaded Photo": 3,
    "Class": "Natural Attraction",
    "Address": "Pulau Setokok, Kec. Bulang, Kota Batam, Kepulauan Riau 29475",
    "Disctrict": "Bulang",
    "Operational Hour": "24 hours",
    "Desc.": "Agro Mulyo Eco Adventures is an agrotourism and eco-adventure park located in Batam, Riau Islands Province, Indonesia. The destination focuses on promoting sustainable tourism and providing visitors with opportunities to enjoy outdoor activities and learn about eco-friendly practices.\nAgro Mulyo Eco Adventures provides a thrilling and educational experience for nature enthusiasts and adventure seekers in Batam, Indonesia. It's an excellent opportunity to connect with nature, learn about eco-friendly practices, and enjoy outdoor activities in a sustainable and responsible manner.",
    "Activity": "1. Eco-Adventure Activities: The park may offer various eco-adventure activities such as nature trekking, jungle exploration, and wildlife spotting.\n2. Canopy Walk: Some eco-adventure parks include canopy walkways that allow visitors to experience walking among the treetops, providing unique views of the forest and its inhabitants.\n3. Birdwatching: Agro Mulyo Eco Adventures may be home to various bird species, making it a suitable place for birdwatching enthusiasts.\n4. Nature Education: The park may have educational programs and guided tours that provide insights into local flora, fauna, and conservation efforts.\n5. Camping and Bonfires: Some eco-adventure parks offer camping facilities where visitors can spend the night in the midst of nature and enjoy bonfires.\n6. Outdoor Team-Building Activities: Agro Mulyo Eco Adventures may offer team-building activities that promote cooperation and problem-solving among groups.",
    "Picture": "",
    "": ""
  },
  {
    "id": 19,
    "Longitude": "",
    "Latitude": "",
    "Nama": "Panbil Nature Reserve",
    "Downloaded Photo": 3,
    "Class": "Natural Attraction",
    "Address": "Jalan Kantong Semar, Panbil, Batam Kota, Batam City, Riau Islands 29437",
    "Disctrict": "Batam Kota",
    "Operational Hour": "09.00-19.00",
    "Desc.": "Panbil Nature Reserve is a gem for nature lovers located on the island of Batam. It is a protected area that showcases the island's biodiversity, providing visitors with an opportunity to explore and experience the beauty of Indonesian flora and fauna. The reserve encompasses lush forests, pristine wetlands, and serene lakes, creating a tranquil escape from the bustling city life.",
    "Activity": "1. Nature Walks: Enjoy leisurely walks or guided hikes through the nature reserve's trails. The well-marked paths allow visitors to discover the diverse plant life and spot various bird species and other wildlife.\n2. Bird Watching: Bring your binoculars and camera to capture the breathtaking sights of numerous bird species that inhabit the reserve. Some of the common birds you might encounter include kingfishers, hornbills, and various colorful songbirds.\n3. Wildlife Photography: For photography enthusiasts, Panbil Nature Reserve offers excellent opportunities to capture the beauty of native flora and fauna. Keep an eye out for macaques, flying squirrels, and reptiles as you explore the reserve.\n4. Canoeing/Kayaking: The serene lakes within the reserve are perfect for a peaceful canoeing or kayaking experience. Glide through the calm waters while surrounded by lush greenery and the sounds of nature.\n5. Picnicking: Enjoy a delightful picnic amidst nature with family and friends. There are designated picnic spots with facilities for visitors to relax and relish the tranquility of the reserve.\n6. Nature Education: Learn about the local ecosystem and the efforts taken to conserve the natural habitat through informative displays and educational programs available in the reserve.\n7. Photography Workshops: If you want to enhance your photography skills, consider participating in photography workshops organized by local experts. They can provide insights into capturing the best wildlife and landscape shots.\n8. Sunset Watching: Wrap up your day at Panbil Nature Reserve by witnessing a stunning sunset over the landscape, creating a picture-perfect end to your nature-filled adventure.",
    "Picture": "",
    "": ""
  },
  {
    "id": 20,
    "Longitude": "",
    "Latitude": "",
    "Nama": "Tanjung Memban",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29466",
    "Disctrict": "Nongsa",
    "Operational Hour": "09.00-19.00",
    "Desc.": "Tanjung Memban in Nongsa, Batam, offers a wonderful coastal escape for those seeking a peaceful and enjoyable beach experience. It's an excellent destination for beach lovers and nature enthusiasts, providing an opportunity to unwind and appreciate the natural beauty of Batam, Indonesia.",
    "Activity": "1. Beach Activities: Tanjung Memban offers visitors the opportunity to relax on the sandy beaches, enjoy beach games, and swim in the calm waters.\n2. Island Hopping: Tanjung Memban is close to several small islands, and visitors may have the option to go on island-hopping tours to explore nearby islets.\n3. Seafood Dining: Being a coastal area, Tanjung Memban may offer seafood restaurants where visitors can savor fresh and delicious seafood dishes.\n4. Sunset Views: Witnessing the mesmerizing sunset over the sea is a popular activity at Tanjung Memban, providing a memorable and serene experience.\n5. Photography: The picturesque landscapes and coastal views make it a great location for photography.",
    "Picture": "",
    "": ""
  },
  {
    "id": 21,
    "Longitude": "",
    "Latitude": "",
    "Nama": "Pantai Melayu",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29466",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Melayu in Nongsa, Batam, offers a delightful beach experience for travelers looking to unwind and enjoy the natural beauty of the coastline. Whether you're seeking relaxation or water activities, Pantai Melayu provides a serene and enjoyable destination on the island of Batam, Indonesia.",
    "Activity": "1. Beach Activities: Pantai Melayu offers a peaceful setting for beach activities like sunbathing, beach volleyball, and building sandcastles.\n2. Swimming and Water Sports: The calm and clear waters of the beach make it suitable for swimming and various water sports such as snorkeling, jet skiing, and kayaking.\n3. Picnicking: Visitors can enjoy picnics by the beach, taking in the scenic views and savoring delicious meals amidst the natural beauty.\n4. Seafood Dining: Pantai Melayu is close to the sea, and visitors can find local seafood restaurants serving freshly caught seafood dishes.\n5. Sunset Views: Watching the sunset at Pantai Melayu is a popular activity, as the sky turns into shades of orange and pink over the horizon.\n6. Photography: The picturesque surroundings and the beach's serene ambiance make it a great spot for photography.",
    "Picture": "",
    "": ""
  },
  {
    "id": 22,
    "Longitude": "1.188364",
    "Latitude": "104.077354",
    "Nama": "Pantai Nongsa",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Nongsa offers a serene and enjoyable beach experience for travelers looking to appreciate the natural beauty of Batam's coastline. It's a great place to spend a leisurely day by the sea, enjoying the sun, sand, and the refreshing waters of the ocean in Indonesia.",
    "Activity": "1. Beach Activities: Pantai Nongsa provides a relaxing setting for beach activities such as sunbathing, beachcombing, and playing beach games.\n2. Swimming and Water Sports: The calm and clear waters of the beach make it suitable for swimming and various water sports such as snorkeling, kayaking, and paddleboarding.\n3. Beachfront Resorts: The area around Pantai Nongsa is known for its beachfront resorts, some of which offer beach access, water sports facilities, and dining options.\n4. Seafood Dining: Being close to the sea, Pantai Nongsa may have local seafood restaurants where visitors can enjoy freshly caught seafood dishes.\n5. Relaxation: The tranquil ambiance of Pantai Nongsa makes it an ideal spot for relaxation and unwinding by the sea.\n6. Photography: The scenic beauty of the beach and the surrounding coastal landscapes make it a great location for photography.",
    "Picture": "",
    "": ""
  },
  {
    "id": 23,
    "Longitude": "1.1893046882057359",
    "Latitude": "104.11062956451119",
    "Nama": "Teluk Mata Ikan",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Teluk Mata Ikan in Batam, Indonesia, provides a serene and beautiful setting for visitors to appreciate the natural charm of the bay and enjoy scenic views of the surrounding landscapes. It's a great place to unwind and immerse oneself in the tranquility of nature while visiting the island of Batam.",
    "Activity": "1. Scenic Views: Teluk Mata Ikan offers picturesque views of the bay, surrounded by natural landscapes and greenery, making it a great spot for photography.\n3. Sunset Views: Watching the sunset from Teluk Mata Ikan is a popular activity, as the bay's open expanse provides an excellent vantage point to view the colorful evening sky over the sea.\n3. Relaxation: The tranquil ambiance of the bay makes it a suitable place for relaxation and enjoying the peaceful atmosphere by the water.\n4. Boat Rides: Visitors may have the option to take boat rides or cruises in the bay, allowing them to experience the scenic beauty from the water.",
    "Picture": "",
    "": ""
  },
  {
    "id": 24,
    "Longitude": "1.204200095156528",
    "Latitude": "104.07715651425261",
    "Nama": "Pulau Putri Nongsa",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "",
    "Disctrict": "Nongsa",
    "Operational Hour": "",
    "Desc.": "Pulau Putri Nongsa is a luxurious and tranquil getaway for those seeking an upscale vacation experience amidst the tropical beauty of Batam, Indonesia. It provides an escape into paradise, surrounded by natural splendor and the comforts of a high-end resort.",
    "Activity": "1. Beach Activities: Pulau Putri Nongsa boasts beautiful white sandy beaches where guests can relax, sunbathe, and enjoy beach activities.\n2.Water Sports: The resort may offer various water sports and recreational activities, such as snorkeling, kayaking, and paddleboarding.\nInfinity Pool: Some accommodations at Pulau Putri Nongsa may feature infinity pools with breathtaking views of the sea.\n3. Spa and Wellness: Guests can indulge in spa treatments and wellness services to rejuvenate and relax.\n4. Fine Dining: The island resort offers fine dining experiences with a variety of culinary options and seafood dishes.\n5. Island Exploration: Guests may have the opportunity to explore the island's natural beauty, walking through the lush gardens and enjoying scenic spots.\n6. Weddings and Events: Pulau Putri Nongsa may serve as a venue for weddings and special events due to its stunning backdrop and intimate setting.",
    "Picture": "",
    "": ""
  },
  {
    "id": 25,
    "Longitude": "1.1713605081427432",
    "Latitude": "104.06996421153927",
    "Nama": "Pantai Bale-Bale",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sambau, Kecamatan Nongsa, Kepulauan Riau 29465",
    "Disctrict": "Nongsa",
    "Operational Hour": "07.00-19.00",
    "Desc.": "Pantai Bale-Bale is a serene and picturesque beach destination for travelers seeking a peaceful escape and a chance to enjoy the natural beauty of Batam, Indonesia. It's an ideal spot for unwinding and spending quality time by the sea.",
    "Activity": "1. Beach Activities: Pantai Bale-Bale offers a tranquil setting for relaxation, sunbathing, and enjoying the beachside breeze.\n2. Swimming: The calm waters of the beach are suitable for swimming, especially during low tides.\n3. Picnicking: The beach provides shaded areas and traditional huts known as \"bale-bale\" where visitors can have picnics and enjoy the scenery.\n4. Scenic Views: Pantai Bale-Bale offers picturesque views of the surrounding coastal landscape, making it a great spot for photography.\n5. Beach Walks: Visitors can take leisurely walks along the shoreline, enjoying the peaceful environment.\n6. Local Cuisine: There may be food vendors or stalls offering local Indonesian snacks and refreshments near the beach.",
    "Picture": "",
    "": ""
  },
  {
    "id": 26,
    "Longitude": "1.14246",
    "Latitude": "104.147489",
    "Nama": "Sekilak",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29466",
    "Disctrict": "Nongsa",
    "Operational Hour": "09.00-19.00",
    "Desc.": "Sekilak in Batam offers a charming coastal experience for travelers looking to enjoy the beauty of the beach and engage in various outdoor activities. Whether you want to relax by the sea, explore the natural surroundings, or indulge in water sports, Sekilak provides a delightful destination for your time in Batam, Indonesia.",
    "Activity": "1. Beach Activities: Sekilak offers visitors the chance to enjoy beach activities such as sunbathing, beachcombing, and playing beach games.\n2. Water Sports: The area may provide opportunities for water sports such as swimming, snorkeling, and jet skiing.\n3. Fishing: Fishing is a popular activity in Sekilak, and visitors may have the option to go fishing on the coast or through local fishing charters.\n4. Seafood Dining: Being a coastal area, Sekilak may have seafood restaurants or local eateries where visitors can enjoy freshly caught seafood dishes.\n5. Scenic Views: Sekilak provides picturesque views of the coastline and the surrounding natural beauty, making it a great spot for photography.\n6. Relaxation: The tranquil atmosphere of Sekilak makes it an ideal place for relaxation and unwinding by the sea.",
    "Picture": "",
    "": ""
  },
  {
    "id": 27,
    "Longitude": "1.1489806090070427",
    "Latitude": "104.14075445795682",
    "Nama": "Pantai Lagorap",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29467",
    "Disctrict": "Nongsa",
    "Operational Hour": "08.00-17.30",
    "Desc.": "As Pantai Lagorap might be a less-developed or local beach area, there may be limited tourist facilities and activities available. However, if you are looking for a more secluded and off-the-beaten-path beach experience, Pantai Lagorap could offer a peaceful and serene atmosphere.",
    "Activity": "1. Beach Activities: Pantai Lagorap may provide visitors with the opportunity to enjoy beach activities such as sunbathing, swimming, and beachcombing.\n2. Picnicking: The beach could be a suitable spot for picnics and enjoying meals amidst the natural surroundings.\n3. Scenic Views: Pantai Lagorap might offer scenic views of the sea and coastline, making it a nice location for photography.\n4. Relaxation: If you're looking for a tranquil and less crowded beach experience, Pantai Lagorap may be a good option for unwinding and enjoying the peaceful ambiance.",
    "Picture": "less known",
    "": ""
  },
  {
    "id": 28,
    "Longitude": "1.146395",
    "Latitude": "104.141837",
    "Nama": "Pantai Ketapang",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29459",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Ketapang is a popular beach destination that offers a mix of activities and opportunities to enjoy the beauty of the coastline in Batam, Indonesia. Whether you want to bask in the sun, engage in water sports, or simply relax by the sea, Pantai Ketapang provides an enjoyable beach experience for visitors.",
    "Activity": "Beach Activities: Pantai Ketapang offers a variety of beach activities such as sunbathing, swimming, and playing beach games.\nWater Sports: The beach may provide opportunities for water sports, including snorkeling, jet skiing, and banana boat rides.\nLocal Cuisine: Visitors can try local Indonesian snacks and refreshments from food vendors or beachside cafes.\nSeafood Dining: Being a coastal area, Pantai Ketapang may have seafood restaurants where visitors can enjoy freshly caught seafood dishes.\nScenic Views: The beach provides scenic views of the ocean and surrounding landscapes, making it a great spot for photography.\nRelaxation: The tranquil atmosphere of Pantai Ketapang makes it a suitable place for relaxation and enjoying the natural surroundings.",
    "Picture": "",
    "": ""
  },
  {
    "id": 29,
    "Longitude": "1.145179",
    "Latitude": "104.143144",
    "Nama": "Pantai Boneta",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29466",
    "Disctrict": "Nongsa",
    "Operational Hour": "07.45-21.45",
    "Desc.": "Pantai Boneta, also known as Boneta Beach, is a scenic beach located in Batam, Riau Islands Province, Indonesia. It is situated on the southwestern coast of Batam and is known for its pristine sandy shores and clear blue waters.",
    "Activity": "1. Beach Activities: Pantai Boneta offers a relaxing environment for beach activities such as sunbathing, beachcombing, and building sandcastles.\n2. Swimming: The calm waters of the beach make it suitable for swimming and enjoying a refreshing dip in the sea.\n3. Picnicking: The beach provides open spaces and shaded areas where visitors can have picnics and enjoy meals with family and friends.\n4. Scenic Views: Pantai Boneta offers picturesque views of the sea and the surrounding coastal landscapes, making it a great spot for photography.\n5. Relaxation: The tranquil atmosphere of Pantai Boneta makes it an ideal place to unwind and enjoy the natural beauty of the beach.",
    "Picture": "",
    "": ""
  },
  {
    "id": 30,
    "Longitude": "1.1444940650400677",
    "Latitude": "104.14435736424663",
    "Nama": "Pantai Tanda Pesona",
    "Downloaded Photo": "no photo source",
    "Class": "Beach",
    "Address": "Batu Besar, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29466",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Tanda Pesona offers a delightful beach experience for travelers looking to enjoy the beauty of the coastline and unwind in a peaceful setting. It's a great destination for spending leisurely moments by the sea and immersing oneself in the natural charm of Batam, Indonesia.",
    "Activity": "1. Beach Activities: Pantai Tanda Pesona offers a tranquil setting for beach activities such as sunbathing, beachcombing, and playing beach games.\n2. Swimming: The beach may provide safe areas for swimming, allowing visitors to enjoy the refreshing waters.\n3. Picnicking: Pantai Tanda Pesona provides open spaces and shaded areas where visitors can have picnics and enjoy meals with family and friends.\n4. Scenic Views: The beach offers scenic views of the sea and the natural beauty of the coastal landscape, making it a great spot for photography.\n5. Relaxation: The serene atmosphere of Pantai Tanda Pesona makes it an ideal place to relax and enjoy the tranquility of the beach.",
    "Picture": "",
    "": ""
  },
  {
    "id": 31,
    "Longitude": "1.1912065336750406",
    "Latitude": "104.0836251155722",
    "Nama": "Nuvasa Bay",
    "Downloaded Photo": "",
    "Class": "Artificial Attraction",
    "Address": "",
    "Disctrict": "Nongsa",
    "Operational Hour": "",
    "Desc.": "",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 32,
    "Longitude": "1.0888",
    "Latitude": "104.135199",
    "Nama": "Pantai Panau",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Kabil, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29467",
    "Disctrict": "Nongsa",
    "Operational Hour": "08.00-18.00",
    "Desc.": "Pantai Panau is characterized by its white sandy shores, clear blue waters, and swaying palm trees, making it an ideal spot for beach lovers. The beach is relatively serene compared to some of the more crowded and developed beaches on Batam, making it a great place to unwind and enjoy the natural beauty of the surroundings.",
    "Activity": "1. Swimming: The calm and shallow waters of Pantai Panau make it suitable for swimming. Whether you're a skilled swimmer or just want to cool off in the sea, the beach offers a pleasant swimming experience.\n2. Sunbathing: Relax on the soft sandy beach and soak up the tropical sun. Bring a beach towel or rent a beach chair and umbrella for a comfortable sunbathing session.\n3. Beach Picnics: Pack a picnic basket with your favorite snacks and enjoy a beachside picnic with friends or family. The scenic beauty of Pantai Panau enhances the dining experience.\n4. Photography: The picturesque setting of Pantai Panau makes it an excellent location for photography. Capture stunning seascapes, sunsets, and natural beauty while you're there.\n5. Beach Volleyball: If you're traveling with a group of friends, consider bringing a volleyball and play a friendly game on the sandy shores.\n6. Seafood Dining: There are local eateries and seafood restaurants near Pantai Panau where you can savor delicious fresh seafood dishes.\n7. Boat Tours: Some tour operators may offer boat tours from Pantai Panau to nearby islands or other scenic spots along the coast. These tours might include snorkeling opportunities or visits to neighboring beaches.",
    "Picture": "",
    "": ""
  },
  {
    "id": 33,
    "Longitude": "1.1477308735911975",
    "Latitude": "104.1421067365945",
    "Nama": "Pantai Payung",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Kampung Melayu, Batu Besar, Batam, Kota Batam, Kepulauan Riau 29467",
    "Disctrict": "Nongsa",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Payung is known for its picturesque scenery, with soft sandy shores and clear blue waters. The beach is named after the traditional Indonesian \"payung\" or umbrella-like rock formations that can be found along the coastline. These unique rock formations add to the beach's charm and provide a distinctive backdrop for visitors.",
    "Activity": "1. Beach Relaxation: Pantai Payung is a great spot to unwind and enjoy the tranquility of the coastal setting. Relax on the beach, read a book, or simply take in the beautiful surroundings.\n2. Photography: The stunning landscape of Pantai Payung makes it a favorite spot for photography enthusiasts. Capture the breathtaking views of the beach, sea, and the distinct \"payung\" rock formations.\n3. Water Sports: Depending on the local facilities and operators available, you might have the opportunity to enjoy water sports such as jet skiing, kayaking, or snorkeling. \n4. Beach Walks: Take a leisurely stroll along the shoreline and explore the beach's natural beauty. Walking during low tide can reveal interesting marine life in the tide pools.\n5. Local Cuisine: There might be small local eateries or food vendors near Pantai Payung offering traditional Indonesian snacks and refreshments. Don't miss the chance to try some local delicacies.\n6. Sunset Views: The beach's west-facing location makes it an excellent spot to catch a mesmerizing sunset over the sea. Witnessing the sun sinking below the horizon is a memorable experience.\n7. Rock Formations Exploration: Take a closer look at the unique \"payung\" rock formations found along the beach. Be cautious and respectful of the natural environment while exploring.",
    "Picture": "",
    "": ""
  },
  {
    "id": 34,
    "Longitude": "0.8591841215307142",
    "Latitude": "104.1459034939578",
    "Nama": "Pantai Melayu Barelang",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Jalan Trans Barelang, Bulang, Rempang Cate, Galang, Kota Batam, Kepulauan Riau 29482",
    "Disctrict": "Galang",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Melayu Barelang is characterized by its soft sandy shores, clear turquoise waters, and lush greenery along the coastline. The beach offers a picturesque setting, with views of the surrounding islands and the iconic Barelang bridges, which connect Batam with several neighboring islands.",
    "Activity": "Beach Activities: Pantai Melayu Barelang is perfect for beach activities such as sunbathing, beachcombing, and building sandcastles. Relax on the sandy shore and enjoy the tropical ambiance.\nSwimming: The calm and shallow waters near the shore are suitable for swimming. However, always exercise caution and adhere to any safety guidelines, as conditions can vary.\nPicnics and Barbecues: The beach provides an excellent spot for picnics and barbecues with family and friends. Enjoy a delightful meal while taking in the beautiful views of the sea and neighboring islands.\nPhotography: Capture stunning photographs of the beach, the surrounding landscapes, and the iconic Barelang bridges. The beach's scenic beauty offers ample opportunities for photography.\nWater Sports: Depending on local facilities and operators, you may find water sports activities such as jet skiing, banana boat rides, and snorkeling. Check with local providers for availability and safety measures.\nBarelang Bridge Tour: Take a drive or a guided tour across the Barelang bridges to explore the neighboring islands and enjoy panoramic views of the sea and the archipelago.\nLocal Cuisine: Try some local Indonesian dishes at nearby eateries or food stalls. Seafood is often a popular choice in this coastal region.\nIsland Hopping: Explore other nearby islands in the Barelang chain. Each island has its own unique attractions and charms, making island hopping an exciting adventure.\nFishing: If you enjoy fishing, inquire about the possibility of fishing trips or shore fishing activities available in the area.",
    "Picture": "",
    "": ""
  },
  {
    "id": 35,
    "Longitude": "0.7567330153332622",
    "Latitude": "104.18607202715529",
    "Nama": "Pantai Melur Barelang",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sijantung, Pulau Galang, Kota Batam, Kepulauan Riau 29485",
    "Disctrict": "Galang",
    "Operational Hour": "24 hours",
    "Desc.": "This beach is popular for its exotic nature and incredibly beautiful coastal area that captivates the eyes. Therefore, the local community has made this beach one of the primary natural tourist destinations that shouldn't be missed.\n\nIn addition to its breathtaking beauty, this beach also holds significant historical value. This tourist spot will make you momentarily forget all the daily problems or burdens. Moreover, you can experience various enjoyable moments when spending your vacation time at this beach.",
    "Activity": "1. Playing Water Rides\nAt Melur Beach, water rides that support tourism in the area are already prepared. Although there are not many rides available there, rest assured that you can still experience excitement.\nSome water rides that you can find there include banana boats and special floats for tourists who want to swim. Even though the rides are still relatively limited, visiting there will not make you regret it after witnessing the beauty of the beach.\n\n2. Hunting for Culinary Delights\nIn addition to playing water rides, when visiting Melur Beach, you can also enjoy culinary tourism. Along the coastal area, there are restaurants and food stalls lined up, offering a variety of typical culinary menus.\nMost of the dishes served there are local dishes typical of Sumatra and also seafood delicacies. Surely, you will not regret tasting the deliciousness of various culinary menus there.\n\n3. Taking Photos\nDuring the daytime, the beach tends to be quiet due to the intense sunlight. However, behind the quiet atmosphere during the day, you can enjoy the beauty more freely.\nBeach Sports\nThe location of the beach is flanked by land that juts into the sea, which makes this beautiful beach not have a wide coastal view. Moreover, the currents at this beach are not too strong.\nSo, this kind of atmosphere is perfect for tourists who want to do beach sports, such as beach volleyball, soccer, and others. These activities will undoubtedly make your body fitter.\n\n4. Camping at Melur Beach\nCamping is one of the best activities that can be done on this beach at night. During the night, the atmosphere at the beach is very comfortable due to the sound of the waves and the chorus of crickets. Plus, the twinkling stars in the sky are very captivating.\nThis activity will be even more enjoyable when done with family, friends, or a partner. You can make a bonfire to roast corn or sausages accompanied by guitar music. Guaranteed, your night at this beach will become more memorable.",
    "Picture": "",
    "": ""
  },
  {
    "id": 36,
    "Longitude": "0.583485",
    "Latitude": "104.197831",
    "Nama": "Pulau Abang",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "",
    "Disctrict": "Galang",
    "Operational Hour": "24 hours",
    "Desc.": "Pulau Abang (Abang Island) is one of the islands that make up the Riau Islands province in Indonesia. It is situated near Batam, which is one of the main gateways to the Riau Islands. Abang Island is known for its natural beauty, clear waters, and marine biodiversity, making it a popular destination for day trips and island hopping adventures.",
    "Activity": "1. Snorkeling and Diving: The waters around Pulau Abang are teeming with marine life and coral reefs, making it an excellent spot for snorkeling and diving. Explore the underwater world and witness colorful fish and other marine creatures.\n2. Beach Relaxation: The island offers serene and picturesque beaches where you can unwind and enjoy the tranquility of the surrounding nature. Relax on the sandy shores and soak up the tropical atmosphere.\n3. Island Hopping: Pulau Abang is part of the Riau Islands archipelago, and you can explore nearby islands as part of an island hopping tour. Each island has its own unique charm and attractions.\n4. Nature Walks: Take a leisurely walk around the island to enjoy its natural beauty. You might come across lush vegetation, coconut trees, and perhaps even some wildlife.\n5. Fishing: If you enjoy fishing, inquire about the possibility of fishing trips or shore fishing activities around Pulau Abang.\n6. Picnics and Barbecues: Many tour operators offer day trips to Pulau Abang that include picnic lunches or beachside barbecues. It's a great way to enjoy a meal in the beautiful island setting.\n7. Photography: With its scenic landscapes and crystal-clear waters, Pulau Abang provides excellent opportunities for photography enthusiasts.",
    "Picture": "",
    "": ""
  },
  {
    "id": 37,
    "Longitude": "0.773336",
    "Latitude": "104.173366",
    "Nama": "Pantai Mirota",
    "Downloaded Photo": 4,
    "Class": "Beach",
    "Address": "Desa Sijantung, Kelurahan Galang Barelang, Pulau Galang, Batam, Sijantung, Galang, Kota Batam, Kepulauan Riau 29485",
    "Disctrict": "Galang",
    "Operational Hour": "06.00-19.00",
    "Desc.": "The charm of Pantai Mirota is different from other destinations because it remains natural and is surrounded by breathtaking scenery. The crystal-clear seawater and the sand form a combination of beauty that will delight the eyes. If you arrive in the morning, tourists can explore the area by strolling along Pantai Mirota. Not only that, there are also traditional boats available for rent to cruise the waters around the beach. It's no wonder that many tourists from abroad are interested in vacationing to this destination because of its uniqueness.",
    "Activity": "1. Water Activities\nPantai Mirota offers exciting water games to be tried with close friends and family. Tourists can rent a banana boat, go parasailing, or try jet skiing, making their vacation even more enjoyable. These activities can only be done when the weather is favorable to ensure the safety of the beach's waves. So, it's best to visit during the daytime.\n\n2. Beach Picnic\nPicnicking is a common activity when visiting beach destinations. The serene and comfortable beach area is perfect for gathering with family. Travelers can bring food and mats to enjoy the gentle sea breeze. However, after the picnic, it's essential not to litter plastic waste carelessly.\n3. Photo Hunting\nTaking photos around Pantai Mirota is a popular activity among tourists. The soft sand and clear seawater create beautiful snapshots. Moreover, the presence of flowers and lush green trees adds a natural touch to the background. So, you can freely indulge in photo hunting by choosing various spots at this beach destination.\n4. Playing in the Sand\nThe beach sand itself is a fascinating attraction for playtime. Tourists can bring sand molds or a volleyball to make the most of their holiday. The soft sand is also perfect for sunbathing in the morning. These diverse activities ensure that the vacation remains enjoyable.\n5. Swimming\nPantai Mirota has moderately-sized waves and very clear water. Visitors can swim near the shore while using floats. However, it's important to follow the safety rules and avoid swimming in the open sea, as it can be dangerous. Enjoy your vacation by taking your family for a swim in this beautiful beach.\n6. Culinary Tour\nVarious snacks and hearty meals are sold around Pantai Mirota, attracting many guests. Additionally, the area offers specialty dishes cooked with flavorful spices. Tourists can try fresh coconut ice and seafood, which are popular culinary choices at the beach. The food stalls are also equipped with comfortable tables and chairs.\nBoat Rides\nDuring the daytime, many fishing boats line the coast of Pantai Mirota. Some of these boats are available for rent for travelers who wish to explore. You will be accompanied by guides during the journey to witness the beauty of the sea up close. Visitors can also observe small fish swimming freely in this stunning beach area.",
    "Picture": "",
    "": ""
  },
  {
    "id": 38,
    "Longitude": "0.7513682552872534",
    "Latitude": "104.19068602606477",
    "Nama": "Pantai Vio-Vio",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sijantung, Galang, Kota Batam, Kepulauan Riau 29485",
    "Disctrict": "Galang",
    "Operational Hour": "06.00-19.00",
    "Desc.": "Pantai Viovio is a popular tourist destination that is a must-visit, especially during holidays. This beach, located near the Barelang Bridge 5, boasts incredibly beautiful natural scenery, from the lush mangrove forests to the pristine white sandy shores.\n\nThe seawater at this picturesque beach has gentle waves, making it ideal for tourists who want to play in the water or go snorkeling at this Batam gem. If you're visiting with your family, you can rent a gazebo that can accommodate an entire family.\n\nFrom within the gazebo, you can enjoy the breathtaking view of the Viovio Beach's vast expanse of white sand and the stunning sight of the sun setting on the western horizon.",
    "Activity": "1. Water Fun at Pantai Viovio\nPantai Viovio, a renowned natural beach destination in Batam, offers a perfect playground for water enthusiasts. Its clear seawater and inviting white sandy shores create an ideal spot for visitors of all ages, including kids and non-swimmers, to enjoy the gentle waves and have a splashing good time.\n2. Embracing the Beach's Natural Beauty\nAt Pantai Viovio, bask in the beauty of unspoiled nature. Relax in the charming gazebos and soak in the mesmerizing views of the ivory sands, the tranquil waves, and the lush mangrove forests that adorn the beachfront.\n3. Cherishing Sunset Views\nWitness the enchanting sunset moments at Pantai Viovio; it's an experience not to be missed. As the sun sets over the horizon, the beach transforms into a peaceful and cozy haven, making it a perfect setting for romantic moments with your loved ones.\n4. Taking Photos\nCapture the magic of Pantai Viovio with your camera. There are plenty of picturesque spots, from the glistening white sands to the inviting swings by the shore and other charming corners that are perfect for creating lasting memories and Instagram-worthy shots.\n5. Quality Time with Loved Ones\nAs the night sets in, the fun continues at Pantai Viovio. Enjoy stargazing under the night sky while feeling the gentle sea breeze. The colorful lights adorning The Whitesand Cafe and surrounding gazebos add to the delightful ambiance, and you might even be serenaded by live music performances on weekends.\n6. Camping by the Coast\nFor a unique nature experience, consider camping by the beach at Pantai Viovio. Choose from two camping areas, one for smaller groups and another for larger gatherings. It's a fantastic opportunity to connect with nature, create cherished memories, and savor the beauty of this idyllic coastal setting.",
    "Picture": "",
    "": ""
  },
  {
    "id": 39,
    "Longitude": "",
    "Latitude": "",
    "Nama": "Pantai Dendang Melayu",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Tembesi, Kec. Sagulung, Kota Batam, Kepulauan Riau 29472",
    "Disctrict": "Segulung",
    "Operational Hour": "06.00-20.00",
    "Desc.": "Pantai Dendang Melayu, located in Batam, Kepulauan Riau (Kepri), is a captivating destination for sustainable tourism. Its natural beauty is highlighted by picturesque coastal views, small surrounding islands, and thriving mangrove vegetation. Visitors are mesmerized by the stunning sunsets, with the amber glow illuminating the beach and nearby sea. The Menara Pandang observation tower offers the perfect spot to capture unforgettable moments with the iconic Jembatan 1 Barelang in the background. Additionally, the beach boasts comprehensive facilities, including an entertainment stage, diverse seafood vendors, souvenir shops, a prayer room, clean restrooms, and ample parking, ensuring a delightful and comfortable experience for all who visit Pantai Dendang Melayu.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 40,
    "Longitude": "0.6248673884725112",
    "Latitude": "104.28490267905522",
    "Nama": "Pantai Elyora",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Galang Baru, Galang, Kota Batam, Kepulauan Riau 29487",
    "Disctrict": "Galang",
    "Operational Hour": "08.00-18.30",
    "Desc.": "Elyora Beach in Batam is a popular destination with a vast shoreline reminiscent of its sister beach, Reviola Beach. During low tide, the expansive sandy coast becomes an ideal playground for various activities such as soccer, volleyball, and jogging. Elyora Beach is renowned for its soft and white sand, offering a picturesque setting for family picnics and children's play. Seeking refuge from the sun, visitors relax under the grand dry mangrove trees, capturing moments of beauty in photographs beneath their striking canopies.",
    "Activity": "1. Trying Out the Water Activities\nIf you're getting bored with just swimming or playing in the sand, here you'll find exciting water activities to try. The beach management has provided water facilities such as banana boats and small boats.\nFor thrill-seekers, the banana boat ride can be the perfect choice. Don't worry, as the banana boat ride comes with guaranteed safety measures. To enjoy this experience, you'll need to prepare a budget in addition to the entrance fee, of course.\n\n2. Capturing Pictures at Beautiful Spots\nIt would feel incomplete to visit an exotic and enchanting place without taking photos and capturing those special moments. This is what tourists do when they come to Pantai Elyora. Not surprisingly, because the beach offers numerous Instagram-worthy photo spots, perfect for sharing on social media.\n3. Swimming by the Beach and Playing in the Sand\nThe gentle and friendly waves make it safe for swimming at the beach. However, it's crucial to prioritize safety for yourself and others around you.\nBefore swimming, ensure that you are a competent swimmer and use safety equipment such as a life jacket. If you don't have these items, there are rental services available for your convenience.",
    "Picture": "",
    "": ""
  },
  {
    "id": 41,
    "Longitude": "0.6428505942500103",
    "Latitude": "104.28807360083346",
    "Nama": "Tegar Bahari",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Galang Baru, Galang, Kota Batam, Kepulauan Riau 29487",
    "Disctrict": "Galang",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Tegar Bahari is a captivating beach destination on Galang Island, Batam, with a 500-meter-long pristine coastline. Accessible by various vehicles, it attracts both local and foreign tourists, offering a tranquil ambiance and clear waters for leisurely activities. The beach is family-friendly, and the management ensures cleanliness with regular patrols, providing essential facilities like parking, pavilions, and beachfront houses, making it an ideal spot for a memorable and rejuvenating beach getaway.",
    "Activity": "",
    "Picture": "",
    "": ""
  },
  {
    "id": 42,
    "Longitude": "0.6507126168604905",
    "Latitude": "104.28419913674782",
    "Nama": "Reviola",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Galang Baru, Galang, Batam City, Riau Islands 29487",
    "Disctrict": "Galang",
    "Operational Hour": "07.00-23.00",
    "Desc.": "Pantai Reviola is a captivating tourist spot that should not be missed, particularly during holidays. Its charm lies in the serene and vast coastline, adorned with small huts topped with thatched roofs, providing comfortable resting places for visitors. The beach boasts a diverse array of trees, including pine, mangrove, and coconut, offering shade and relaxation. The well-maintained open land is perfect for various activities such as picnicking, photography, and games, while swings and long benches facing the sea add to the appeal. With clean surroundings, ample amenities, and gentle waves, Pantai Reviola promises a delightful escape for both relaxation and adventure seekers alike.",
    "Activity": "1. Renting a Banana Boat\nThe fee for renting a banana boat is Rp 150,000 for a maximum of 6 passengers. By availing this exciting water sport facility, you can venture out into the sea. The thrill is amplified when you come with a group of friends. It's truly a challenging and exhilarating experience.\n2. Swimming\nA mainstream activity, yet always enticing to try. It becomes even more enjoyable if you teach little ones how to swim. The waters at Pantai Reviola are surrounded by gentle waves. If you are overly concerned, you can swim near the shoreline.\n3. Beach Walk\nThe shoreline stretches approximately 800 meters, a manageable distance to explore. This activity is perfect to enjoy with your partner, especially during the late afternoon. Take a leisurely walk while waiting for the sunset.\nIt's advisable to wear a wide-brimmed hat to shield yourself from direct sunlight. Occasionally, you can search for unique seashells buried in the sand. Feel free to take off your footwear as the sand's texture is soft.\n\n4. Playing Soccer or Volleyball\nPrepare the equipment from home and make plans with friends. Ensure everyone in the group is ready to participate. Set some rules and penalties to make it more engaging and fun.",
    "Picture": "",
    "": ""
  },
  {
    "id": 43,
    "Longitude": "1.1484703512166674",
    "Latitude": "103.89148321451437",
    "Nama": "Pantai Pasir Putih",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Sekanak Raya, Belakang Padang, Kota Batam, Kepulauan Riau",
    "Disctrict": "Belakang Padang",
    "Operational Hour": "08.00-22.00",
    "Desc.": "Pantai Pasir Putih is situated on the western coast of Batam, near the area of Belakang Padang. The beach offers a picturesque setting, with palm trees lining the shore and stunning views of the sea. Its name \"Pasir Putih\" translates to \"White Sand\" in Indonesian, which aptly describes the beautiful sandy coastline.",
    "Activity": "1. Beach Activities: Pantai Pasir Putih is perfect for beach activities such as sunbathing, beachcombing, and building sandcastles. Relax on the soft sandy shores and enjoy the coastal breeze.\nSwimming: The waters of Pantai Pasir Putih are generally calm and suitable for swimming. However, always be cautious and adhere to any safety guidelines, especially during changing tides.\n2. Photography: Capture the natural beauty of Pantai Pasir Putih with your camera or smartphone. The beach provides excellent photo opportunities, especially during sunrise and sunset.\n3. Local Cuisine: Nearby eateries and food stalls offer a variety of Indonesian dishes and seafood. Try some local delicacies while enjoying the beach ambiance.\nBeach Volleyball: Some areas of the beach may be suitable for beach volleyball. Bring along a volleyball and gather your friends for a friendly game.\n4. Picnics: Pack a picnic basket with your favorite snacks and have a delightful beachside picnic with family or friends.\nBoat Rides: Depending on local facilities and operators, you may have the opportunity to take boat rides or hire boats to explore nearby islands or enjoy a scenic cruise.\n5. Fishing: If you enjoy fishing, inquire about the possibility of fishing trips or shore fishing activities available in the area.",
    "Picture": "",
    "": ""
  },
  {
    "id": 44,
    "Longitude": "1.1442266595056825",
    "Latitude": "103.92339979662295",
    "Nama": "Pantai Tanjung Pinggir",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Tj. Pinggir, Kec. Sekupang, Kota Batam, Kepulauan Riau",
    "Disctrict": "Sekupang",
    "Operational Hour": "08.00-20.00",
    "Desc.": "Pantai Tanjung Pinggir, situated in Sekupang, Batam, Kepulauan Riau, is a captivating natural tourist destination along the coastal area facing the northern waters of the Singapore Strait, offering distant views of Singapore and Marina Bay Sands. With its gentle slope, brownish sands, and nearby coral clusters, the beach provides a serene setting with relatively calm waves. Visitors can partake in various activities, including exhilarating banana boat rides, canoe rentals for exploring the seascape, camping at the designated grounds, and engaging in outbound adventures or paintball games on the four-hectare hilltop area. Offering a diverse range of experiences, Pantai Tanjung Pinggir promises a delightful and fulfilling destination for an unforgettable vacation.",
    "Activity": "1. Admiring the Beauty of Singapore from Afar\nThe main allure of Pantai Tanjung Pinggir lies in the panoramic view of the towering buildings in neighboring Singapore. On clear days, visitors can witness the high-rise structures that adorn the Singaporean skyline from this beach. One of Singapore's landmark buildings can be seen clearly, along with the iconic triplet skyscrapers. Such a view is unique to Pantai Tanjung, setting it apart from other beaches.\n\n2. Photo Hunting\nAnother unmissable activity is photo hunting. There are numerous breathtaking sights to capture while at Pantai Tanjung Pinggir, making it essential to immortalize these moments with photographs. Don't forget to bring your camera when planning a vacation to this beach.\nDuring low tide, you can witness the beauty of the underwater scenery at Pantai Tanjung. This moment is not to be wasted, as the photo spots in this location are truly Instagram-worthy.\n\n3. Kayaking\nAt Pantai Tanjung, kayak and canoe rentals are available for tourists who wish to explore the beach from the open sea. There are two types of canoes available for rent: single and double canoes, each with different rental fees. Renting a single canoe costs Rp 30,000, while a double canoe costs Rp 50,000.\n4. Paintball\nPantai Tanjung Pinggir offers several adrenaline-pumping attractions, including outbound activities and paintball. Outbound activities can be enjoyed not only on the beach but also on the nearby hill. The vast outbound area covers a total of 4 hectares and offers a variety of thrilling activities, such as adrenaline activities, team building, ice breaking, trouble-solving, and fun games.\nPaintball, in particular, is a popular activity among tourists. The management of this tourist spot provides paintball games for groups of up to 10 participants, ensuring an exciting and memorable experience.",
    "Picture": "",
    "": ""
  },
  {
    "id": 45,
    "Longitude": "0.9837221996045635",
    "Latitude": "104.09980881538735",
    "Nama": "Pantai Tanjung Piayu",
    "Downloaded Photo": 3,
    "Class": "Beach",
    "Address": "Tj. Piayu, Kec. Sei Beduk, Kota Batam, Kepulauan Riau",
    "Disctrict": "Sei Beduk",
    "Operational Hour": "24 hours",
    "Desc.": "Pantai Tanjung Piayu offers a tranquil escape with its soft sandy shores, clear blue waters, and lush greenery along the coastline. The beach is known for its picturesque views of the sea and the nearby islands, making it an ideal spot for relaxation and nature lovers.",
    "Activity": "Beach Relaxation: Pantai Tanjung Piayu is perfect for unwinding and enjoying the peaceful coastal ambiance. Relax on the sandy shore, listen to the waves, and take in the natural beauty of the surroundings.\nSwimming: The waters near Pantai Tanjung Piayu are generally safe for swimming. However, always exercise caution and be aware of any safety guidelines, especially during changing tides.\nPhotography: Capture the stunning landscape of Pantai Tanjung Piayu with your camera or smartphone. The beach's scenic beauty and breathtaking sunsets offer fantastic photo opportunities.\nPicnics: Pack a picnic basket and have a delightful beachside meal with family or friends. There might be shaded areas or facilities for picnics.\nBeach Walks: Take a leisurely stroll along the shoreline and explore the beach's natural beauty. Walking during low tide can reveal interesting marine life and seashells.\nLocal Cuisine: Some nearby eateries or food vendors may offer traditional Indonesian dishes or seafood. Don't miss the chance to try some local delicacies.\nSunset Views: Pantai Tanjung Piayu faces west, making it an excellent spot to witness captivating sunsets over the sea. It's a memorable experience to watch the sun sink below the horizon.\nBoat Rides: Depending on local facilities and operators, you may have the opportunity to take boat rides or hire boats to explore nearby islands or enjoy a scenic cruise.",
    "Picture": "",
    "": ""
  },
  {
    "id": 46,
    "Longitude": "1.152839",
    "Latitude": "104.056425",
    "Nama": "Mega Wisata Ocarina",
    "Downloaded Photo": "",
    "Class": "Park",
    "Address": "",
    "Disctrict": "Batam Kota",
    "Operational Hour": "",
    "Desc.": "",
    "Activity": "",
    "Picture": "",
    "": ""
  }
]
